flashsim_result/sysbench/ctoc_noshadow/nontrx_update_nokey_t60.out
2018. 12. 19. (수) 22:57:48 KST
[SYSBENCH] Running benchmark...
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 16

Doing OLTP test.
Running non-transactional test
Using Uniform distribution
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Threads started!
Time limit exceeded, exiting...
(last message repeated 15 times)
Done.

OLTP test statistics:
    queries performed:
        read:                            0
        write:                           571851
        other:                           0
        total:                           571851
    transactions:                        571851 (9530.29 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 571851 (9530.29 per sec.)
    other operations:                    0      (0.00 per sec.)

Test execution summary:
    total time:                          60.0035s
    total number of events:              571851
    total time taken by event execution: 959.5025
    per-request statistics:
         min:                                  0.09ms
         avg:                                  1.68ms
         max:                                 86.97ms
         approx.  95 percentile:               4.56ms

Threads fairness:
    events (avg/stddev):           35740.6875/53.58
    execution time (avg/stddev):   59.9689/0.00

2018. 12. 19. (수) 22:58:48 KST

------------------------------------------------------------------

mutex_t : 0x38df8ea8 q:0x38df8ea0, size:2048
mutex_t : 0x38df9478 q:0x38df9470, size:1024
mutex_t : 0x38df94d8 q:0x38df94d0, size:1024
mutex_t : 0x38df9538 q:0x38df9530, size:1024
nohost: [dm_nohost_probe] PROBE STARTED
Initializing Connectal & DMA...
subprocess pid 11031 completed status=0 0
[initPortalHardwareOnce:270] fd 5 len 0
[checkSignature:167] read status from '/dev/connectal' was only 0 bytes long
checkSignature: driver 'zynqportal.c' signature mismatch 3431c6f01fcc1c478c8187d1e6992edc e059016ac411386d6e2597d43bc49e15
checkSignature: driver 'portalmem.c' signature mismatch 0ba7c77e370fade81cfa5a0e5abb92f0 eef0fb3bacb31283d694f7aef3d380b3
Main::allocating memory...
USE_ACP = FALSE
USE_ACP = FALSE
Main::allocating memory finished!
[dmaManagerOnce:44]
Requested FCLK[0]=200000000 actually 200000000
Requested Freq: 200.00, Actual Freq: 200.00, status=0
LOG: DEBUG DUMP: gearSend = 1750457657, gearRec = -1303697818, aurSend = -277551347, aurRec = 2117575746, readSend=1936076338, writeSend=950760438
nohost: [dm_nohost_probe] PROBE DONE!
nohost: [dm_nohost_open] open done!
!!! print info !!!
Async status: 1
use wirte buffer: 1
Wait same mapping request(FLYING): 0
use gc polling: 0
use eviction polling: 0
# of total block: 512
# of total page: 8388608
page per block: 16384
# of translation block: 2
# of translation page: 32768
# of data block: 508
# of data page: 8323072
# of total cache mapping entry: 4096
max # of ram reside cme: 1024
max # of clean translation cache table: 512
cache percentage: 25.000%
!!! print info !!!
BM_Init() End!
mutex_t : 0x38e19378 q:0x38e19370, size:1024
mutex_t : 0x38e1fef8 q:0x38e1fef0, size:1024
mutex_t : 0x38e1ff58 q:0x38e1ff50, size:1024
_nos:512
bad_block_checking...[ 99.998474 ]
badblock_cnt: 90
_RNOS:4096
bad block 294912 -> 67092480
bad block 737280 -> 67076096
bad block 770048 -> 67059712
bad block 802816 -> 67043328
bad block 835584 -> 67026944
bad block 1474560 -> 67010560
bad block 1490944 -> 66994176
bad block 1884160 -> 66977792
bad block 2359296 -> 66961408
bad block 4620288 -> 66945024
bad block 5783552 -> 66928640
bad block 5931008 -> 66912256
bad block 6520832 -> 66895872
bad block 6619136 -> 66879488
bad block 8896512 -> 66863104
bad block 9060352 -> 66846720
bad block 9191424 -> 66830336
bad block 11255808 -> 66813952
bad block 12763136 -> 66797568
bad block 13467648 -> 66781184
bad block 13533184 -> 66764800
checking done!
server waiting.....
connected!!!
tpage_GC()

WAF: 1.37
tpage_GC()
tpage_GC()

WAF: 1.39
tpage_GC()
tpage_GC()
tpage_GC()

WAF: 1.40
tpage_GC()
tpage_GC()

WAF: 1.40
tpage_GC()
tpage_GC()
tpage_GC()

WAF: 1.41
tpage_GC()
tpage_GC()
tpage_GC()

WAF: 1.41
tpage_GC()
tpage_GC()

WAF: 1.41
tpage_GC()
tpage_GC()
tpage_GC()

WAF: 1.41
tpage_GC()
tpage_GC()

WAF: 1.41
tpage_GC()
tpage_GC()
tpage_GC()

WAF: 1.41
tpage_GC()
tpage_GC()

WAF: 1.41
tpage_GC()
^C


[cdf]read---
60	2	0.000002
70	1	0.000003
120	3267	0.002882
130	51347	0.048143
140	89117	0.126697
150	48893	0.169795
160	36722	0.202164
170	34028	0.232158
180	27773	0.256639
190	19508	0.273835
200	15429	0.287435
210	14262	0.300007
220	12686	0.311189
230	9729	0.319765
240	8203	0.326996
250	8296	0.334308
260	12394	0.345233
270	33457	0.374724
280	65305	0.432289
290	69735	0.493758
300	64455	0.550573
310	60846	0.604207
320	54872	0.652575
330	47354	0.694316
340	43615	0.732761
350	41185	0.769064
360	37477	0.802099
370	31889	0.830208
380	27677	0.854604
390	24631	0.876316
400	22287	0.895961
410	18547	0.912310
420	15384	0.925870
430	12748	0.937107
440	11071	0.946866
450	9556	0.955289
460	8075	0.962407
470	6757	0.968363
480	5712	0.973398
490	4722	0.977560
500	4099	0.981174
510	3328	0.984107
520	2818	0.986591
530	2368	0.988678
540	1991	0.990433
550	1642	0.991881
560	1379	0.993096
570	1228	0.994179
580	1060	0.995113
590	797	0.995816
600	720	0.996450
610	564	0.996947
620	546	0.997429
630	402	0.997783
640	349	0.998091
650	255	0.998316
660	225	0.998514
670	184	0.998676
680	182	0.998836
690	134	0.998955
700	115	0.999056
710	110	0.999153
720	65	0.999210
730	68	0.999270
740	61	0.999324
750	37	0.999357
760	41	0.999393
770	38	0.999426
780	34	0.999456
790	23	0.999476
800	20	0.999494
810	18	0.999510
820	17	0.999525
830	15	0.999538
840	14	0.999550
850	10	0.999559
860	10	0.999568
870	8	0.999575
880	7	0.999581
890	6	0.999587
900	4	0.999590
910	10	0.999599
920	7	0.999605
930	9	0.999613
940	5	0.999617
950	5	0.999622
960	7	0.999628
970	7	0.999634
980	9	0.999642
990	11	0.999652
1000	4	0.999655
1010	9	0.999663
1020	10	0.999672
1030	9	0.999680
1040	5	0.999684
1050	5	0.999689
1060	10	0.999698
1070	10	0.999706
1080	7	0.999713
1090	6	0.999718
1100	12	0.999729
1110	10	0.999737
1120	5	0.999742
1130	4	0.999745
1140	2	0.999747
1150	9	0.999755
1160	4	0.999758
1170	3	0.999761
1180	4	0.999765
1190	4	0.999768
1200	4	0.999772
1210	3	0.999774
1220	7	0.999781
1230	5	0.999785
1240	2	0.999787
1250	2	0.999788
1260	2	0.999790
1270	1	0.999791
1300	1	0.999792
1340	1	0.999793
1350	1	0.999794
1360	1	0.999795
1380	2	0.999796
1420	2	0.999798
1480	1	0.999799
1490	1	0.999800
1520	1	0.999801
1530	1	0.999802
1540	1	0.999803
1550	2	0.999804
1580	1	0.999805
1590	2	0.999807
2220	1	0.999808
2230	1	0.999809
2280	1	0.999810
2310	1	0.999810
2320	1	0.999811
2400	1	0.999812
2410	1	0.999813
2820	2	0.999815
3020	1	0.999816
3040	4	0.999819
3060	2	0.999821
3080	1	0.999822
3090	1	0.999823
3100	1	0.999824
3120	2	0.999825
6470	1	0.999826
6480	1	0.999827
6510	3	0.999830
6530	1	0.999831
6550	4	0.999834
6590	1	0.999835
6630	1	0.999836
6640	1	0.999837
6650	1	0.999838
6660	1	0.999839
6680	2	0.999840
6690	1	0.999841
6700	1	0.999842
6710	7	0.999848
6720	1	0.999849
6750	1	0.999850
8870	1	0.999851
8880	1	0.999852
9380	3	0.999855
9390	2	0.999856
9410	2	0.999858
9420	2	0.999860
9440	1	0.999861
9450	2	0.999862
9520	2	0.999864
9530	1	0.999865
9540	1	0.999866
9560	4	0.999870
9570	2	0.999871
9580	1	0.999872
9640	2	0.999874
9650	1	0.999875
9800	2	0.999877
9810	4	0.999880
9830	4	0.999884
9850	2	0.999885
9860	1	0.999886
9870	1	0.999887
9880	1	0.999888
9900	3	0.999891
9930	2	0.999892
9950	2	0.999894
9960	2	0.999896
9980	1	0.999897
10000	3	0.999900
10020	1	0.999900
10040	3	0.999903
10050	2	0.999905
10060	1	0.999906
10070	2	0.999907
10080	2	0.999909
10090	2	0.999911
10100	4	0.999915
10110	6	0.999920
10120	2	0.999922
10130	8	0.999929
10150	9	0.999937
10160	3	0.999939
10170	2	0.999941
10190	1	0.999942
10200	1	0.999943
10220	1	0.999944
10230	1	0.999944
10240	1	0.999945
10260	1	0.999946
10270	2	0.999948
10280	2	0.999950
10300	1	0.999951
10310	1	0.999952
10360	3	0.999954
10370	1	0.999955
10380	3	0.999958
10400	3	0.999960
10410	1	0.999961
10430	3	0.999964
10440	2	0.999966
10450	4	0.999969
10460	1	0.999970
10470	1	0.999971
10480	3	0.999974
10490	2	0.999975
10510	3	0.999978
10520	3	0.999981
10530	2	0.999982
10540	1	0.999983
10560	2	0.999985
10600	2	0.999987
10640	6	0.999992
10670	1	0.999993
10680	3	0.999996
10690	4	0.999999
10750	1	1.000000
a_type	l_type	max	min	avg	cnt	percentage
0	0	62	0	7.250	28	0.00247%
1	0	10235	120	165.152	771200	67.97882%
2	0	6705	273	495.367	512	0.04513%
3	0	10747	249	341.612	362756	31.97578%
--------------------------------------------
|            bench type:                   |
--------------------------------------------
----algorithm----
[0~100(usec)]: 0
[100~200(usec)]: 0
[200~300(usec)]: 0
[300~400(usec)]: 0
[400~500(usec)]: 0
[500~600(usec)]: 0
[600~700(usec)]: 0
[700~800(usec)]: 0
[800~900(usec)]: 0
[900~1000(usec)]: 0
[over_ms]: 0
[over__s]: 0
----lower----
[0~100(usec)]: 0
[100~200(usec)]: 0
[200~300(usec)]: 0
[300~400(usec)]: 0
[400~500(usec)]: 0
[500~600(usec)]: 0
[600~700(usec)]: 0
[700~800(usec)]: 0
[800~900(usec)]: 0
[900~1000(usec)]: 0
[over_ms]: 0
[over__s]: 0
----average----
[avg_algo]: 0.0
[avg_low]: 0.0
-----lower_info----
[write_op]: 0
[read_op]: 0
[trim_op]:0
[WAF, RAF]: 0.000000, 0.000000
[if rw test]: 0.000000(WAF), 0.000000(RAF)
[all write Time]:0.0
[all read Time]:0.0

----summary----
[all_time]: 0.0
[size]: 76601.757812(mb)
[FAIL NUM] 0
[SUCCESS RATIO] 1.000000
[throughput] inf(kb/s)
             inf(mb/s)
[cache hit cnt,ratio] 0, 0.000000
[cache hit cnt,ratio dftl] 0, 0.000000
[READ WRITE CNT] 1134471 8670529
error cnt:111
result of ms:
---
bye bye!
# of gc: 27
# of translation page gc: 27
# of data page gc: 0
# of translation page gc w/ data page gc: 0
# of translation page gc w/ read op: 0
# of evict: 830932
# of buf hit: 3
!!! print info !!!
BH: buffer hit, H: hit, R: read, MC: memcpy, CE: clean eviction, DE: dirty eviction, GC: garbage collection
a_type--->>> 0: BH, 1: H
2: R & MC, 3: R & CE & MC
4: R & DE & MC, 5: R & CE & GC & MC
6: R & DE & GC & MC
!!! print info !!!
Cache hit on read: 0
Cache miss on read: 0
Cache hit on write: 7272676
Cache miss on write: 379676

Clean hit on read: 590606
Dirty hit on read: 201003
Clean hit on write: 89012
Dirty hit on write: 7183664

% of miss : 0.08
# Clean eviction: 362756
# Dirty eviction: 468176

Clean eviciton on read: 362756
Dirty eviction on read: 0
Clean eviction on write: 0
Dirty eviction on write: 468176

Dirty eviction ratio: 56.34%
Dirty eviction ratio on read: 0.00%
Dirty eviction ratio on write: 100.00%

WAF: 1.41

0 27
1 1116636
2 468176
3 1903
4 1903
5 1134468
6 7652352
7 0
8 0
bdbm_mt max: 0
nohost: Wait for all the on-going jobs to finish...
nohost: [dm_nohost_close] MAP Download from HW!
nohost: [dm_nohost_close] closed!
write_q_hit:186818	read_q_hit:2	retry_hit:0